同时在线问题

如下为某直播平台主播开播及关播时间, 根据该数据计算出平台最高峰同时在线的主播人数    online

id		stt						edt
1001	2021-06-14 12:12:12		2021-06-14 18:12:12
1003	2021-06-14 13:12:12		2021-06-14 16:12:12
1004	2021-06-14 13:15:12		2021-06-14 20:12:12
1002	2021-06-14 15:12:12		2021-06-14 16:12:12
1005	2021-06-14 15:18:12		2021-06-14 20:12:12
1001	2021-06-14 20:12:12		2021-06-14 23:12:12
1006	2021-06-14 21:12:12		2021-06-14 23:15:12
1007	2021-06-14 22:12:12		2021-06-14 23:10:12

分析:
采用流式数据的思想, 将一条数据拆分成两条(id,dt,p), 并且对数据进行标记: 开播为1, 关播为-1,
1表示有主播开播在线, -1表示有主播关播离线, 其中dt为开播时间或者关播时间
 id             dt              p
1001    2021-06-14 12:12:12     1
1001    2021-06-14 18:12:12     -1
1001    2021-06-14 20:12:12     1
1001    2021-06-14 23:12:12     -1
1002    2021-06-14 15:12:12     1
1002    2021-06-14 16:12:12     -1
1003    2021-06-14 13:12:12     1
1003    2021-06-14 16:12:12     -1
1004    2021-06-14 13:15:12     1
1004    2021-06-14 20:12:12     -1
1005    2021-06-14 15:18:12     1
1005    2021-06-14 20:12:12     -1
1006    2021-06-14 21:12:12     1
1006    2021-06-14 23:15:12     -1
1007    2021-06-14 22:12:12     1
1007    2021-06-14 23:10:12     -1

然后按照dt排序, 求某一时刻的主播在线人数, 直接对那时刻之前的p求和即可
那要求一天中最大的同时在线人数, 就需要先分别求出每个时刻的同时在线人数, 再取最大值即可
需要用到开窗函数: sum() over(...)

with online as (
    select
        1001 as id,
        '2021-06-14 12:12:12' as stt,
        '2021-06-14 18:12:12' as ent
    union all
    select
        1003 as id,
        '2021-06-14 13:12:12' as stt,
        '2021-06-14 16:12:12' as ent
    union all
    select
        1004 as id,
        '2021-06-14 13:15:12' as stt,
        '2021-06-14 20:12:12' as ent
    union all
    select
        1002 as id,
        '2021-06-14 15:12:12' as stt,
        '2021-06-14 16:12:12' as ent
    union all
    select
        1005 as id,
        '2021-06-14 15:18:12' as stt,
        '2021-06-14 20:12:12' as ent
    union all
    select
        1001 as id,
        '2021-06-14 20:12:12' as stt,
        '2021-06-14 23:12:12' as ent
    union all
    select
        1006 as id,
        '2021-06-14 21:12:12' as stt,
        '2021-06-14 23:15:12' as ent
    union all
    select
        1007 as id,
        '2021-06-14 22:12:12' as stt,
        '2021-06-14 23:10:12' as ent
)
select
    max(sum_p)
from
    (
        select
            id,
            dt,
            sum(p) over(order by dt) as sum_p
        from
            (
                select
                    id,
                    stt as dt,
                    1 as p
                from online
                union all
                select
                    id,
                    ent as dt,
                    -1 as p
                from online
            ) t1
    ) ta1

